package com.wlx.wsolandroid.weapondata;






public class R5WeaponData {
	
		//定义所有R5武器名称
		public static final String[] R5Names={
			"黄龙偃月刀",
			"白虎牙断",
			"蚩尤瀑布碎",
			"断海鞭",
			"灭麒麟牙",	
			"霸海",
			"金刚九天段",
			"虎扑欧狼改",
			"真极牛头",
			"惊天动地",
			"闪飞燕",
			"金丽玉锤",
			"豪龙胆",
			"风伯破天棍",
			"乔美丽",
			"穷奇羽扇",
			"豪风神杖",
			"轰火神杖",
			"朱雀虹",
			"百兽王",		
			"古锭刀真打",
			"阿修罗",
			"轰天雷震盘",
			"升天蛟龙鞭",
			"双极灭星",
			"黄龙钩镰刀",
			"真霸道剑",
			"龙骑尖",
			"怒涛",
			"日月乾坤圈",
			"破军蛇矛",
			"神龙升天刀",
			"朱雀羽扇",
			"业火",
			"白炎黄狼剑",
			"倚天奸剑",
			"宵",
			"霸王",
			"凤嘴凰翼",
			"破邪旋风斩",
			"湖底苍月",
			"月妖日狂",
			"无奏",
			"真黄龙剑",
			"冥天照符",
			"昂龙颚闪",
			"煌天",
			"白虎颚",
			"真天狼剑",
			"乔佳丽",
			"无双方天戟",
			"索冥牙角刃",
			"幻龙炎闪剑",
			"修罗破界棒",
			"伏羲大剑",
			"女娲细剑",
			"刚咆神碎甲",
			"火天玲珑刃",
			"蟠龙红莲牙",
			"堕落"
		};
		
		
		
		
		public static final String[] R5_WeaponData={
			"66244",//黄龙偃月刀
			"47658",//白虎牙断
			"69911",//蚩尤瀑布碎
			"44907",//断海鞭
			"49371",//灭麒麟牙"
			"84878",//霸海
			"64354",//金刚九天段
			"34528",//虎扑欧狼改
			"56027",//真极牛头
			"13396",//惊天动地
			"61184",//闪飞燕
			"28873",//金丽玉锤
			"33431",//豪龙胆
			"74441",//风伯破天棍
			"21328",//乔美丽
			"95428",//穷奇羽扇
			"66134",//豪风神杖
			"72858",//轰火神杖
			"42888",//朱雀虹
			"66680",//百兽王		
			"16690",//古锭刀真打
			"68004",//阿修罗
			"36825",//轰天雷震盘
			"28529",//升天蛟龙鞭
			"73377",//双极灭星
			"35689",//黄龙钩镰刀
			"44802",//真霸道剑
			"61364",//龙骑尖
			"28224",//怒涛
			"36226",//日月乾坤圈
			"76113",//破军蛇矛
			"45307",//神龙升天刀
			"85133",//朱雀羽扇
			"15580",//业火
			"59532",//白炎黄狼剑
			"47235",//倚天奸剑
			"84390",//宵
			"47431",//霸王
			"64815",//凤嘴凰翼
			"26099",//破邪旋风斩
			"33955",//湖底苍月
			"54496",//月妖日狂
			"35827",//无奏
			"59646",//真黄龙剑
			"05817",//冥天照符
			"87745",//昂龙颚闪
			"53378",//煌天
			"79494",//白虎颚
			"74568",//真天狼剑
			"73661",//乔佳丽
			"87421",//无双方天戟
			"51306",//索冥牙角刃
			"51766",//幻龙炎闪剑
			"35069",//修罗破界棒
			"66728",//伏羲大剑
			"75437",//女娲细剑
			"46416",//刚咆神碎甲
			"86094",//火天玲珑刃
			"68041",//蟠龙红莲牙
			"76162",//堕落
		};
		
		
		
		//定义所有R5武器的攻击上升值
		public static final int[] R5AttackValues={
			36,//黄龙偃月刀
			34,//白虎牙断
			36,//蚩尤瀑布碎
			44,//断海鞭
			44,//灭麒麟牙
			38,//霸海
			36,//金刚九天段
			43,//虎扑欧狼改
			35,//真极牛头
			41,//惊天动地
			36,//闪飞燕
			42,//金丽玉锤
			33,//豪龙胆
			37,//风伯破天棍
			42,//乔美丽
			39,//穷奇羽扇
			46,//豪风神杖
			47,//轰火神杖
			34,//朱雀虹
			36,//百兽王
			41,//古锭刀真打
			36,//阿修罗
			33,//轰天雷震盘
			32,//升天蛟龙鞭
			37,//双极灭星
			43,//黄龙钩镰刀
			34,//真霸道剑
			36,//龙骑尖
			32,//怒涛
			43,//日月乾坤圈
			37,//破军蛇矛
			34,//神龙升天刀
			38,//朱雀羽扇
			41,//业火
			35,//白炎黄狼剑
			34,//倚天奸剑
			38,//宵
			34,//霸王
			36,//凤嘴凰翼
			42,//破邪旋风斩
			43,//湖底苍月
			35,//月妖日狂
			33,//无奏
			45,//真黄龙剑
			40,//冥天照符
			38,//昂龙颚闪
			35,//煌天
			37,//白虎颚
			37,//真天狼剑
			37,//乔佳丽
			38,//无双方天戟
			45,//索冥牙角刃
			45,//幻龙炎闪剑
			43,//修罗破界棒
			36,//伏羲大剑
			37,//女娲细剑
			34,//重手甲
			38,//火天玲珑刃
			46,//蟠龙红莲牙
			37,//堕落
		};
		
		//定义所有R5武器的破坏上升值
		public static final int[] R5DestroyValues={
			36,//黄龙偃月刀
			27,//白虎牙断
			49,//蚩尤瀑布碎
			34,//断海鞭
			39,//灭麒麟牙
			44,//霸海
			34,//金刚九天段
			44,//虎扑欧狼改
			36,//真极牛头
			43,//惊天动地
			31,//闪飞燕
			28,//金丽玉锤
			33,//豪龙胆
			44,//风伯破天棍
			31,//乔美丽
			45,//穷奇羽扇
			36,//豪风神杖
			42,//轰火神杖
			42,//朱雀虹
			36,//百兽王
			36,//古锭刀真打
			48,//阿修罗
			36,//轰天雷震盘
			48,//升天蛟龙鞭
			33,//双极灭星
			35,//黄龙钩镰刀
			34,//真霸道剑
			31,//龙骑尖
			38,//怒涛
			36,//日月乾坤圈
			46,//破军蛇矛
			45,//神龙升天刀
			35,//朱雀羽扇
			35,//业火
			29,//白炎黄狼剑
			37,//倚天奸剑
			34,//宵
			37,//霸王
			34,//凤嘴凰翼
			36,//破邪旋风斩
			33,//湖底苍月
			34,//月妖日狂
			45,//无奏
			29,//真黄龙剑
			35,//冥天照符
			37,//昂龙颚闪
			33,//煌天
			29,//白虎颚
			44,//真天狼剑
			33,//乔佳丽
			37,//无双方天戟
			31,//索冥牙角刃
			31,//幻龙炎闪剑
			45,//修罗破界棒
			46,//伏羲大剑
			35,//女娲细剑
			46,//刚咆神碎甲
			46,//火天玲珑刃
			48,//蟠龙红莲牙
			36,//堕落
		};	
		
		//定义所有R5武器的防御上升值
		public static final int[] R5DefenseValues={
			42,//黄龙偃月刀
			36,//白虎牙断
			29,//蚩尤瀑布碎
			29,//断海鞭
			43,//灭麒麟牙
			28,//霸海
			43,//金刚九天段
			35,//虎扑欧狼改
			40,//真极牛头
			33,//惊天动地
			41,//闪飞燕
			38,//金丽玉锤
			44,//豪龙胆
			34,//风伯破天棍
			33,//乔美丽
			44,//穷奇羽扇
			31,//豪风神杖
			38,//轰火神杖
			48,//朱雀虹
			46,//百兽王
			36,//古锭刀真打
			30,//阿修罗
			48,//轰天雷震盘
			35,//升天蛟龙鞭
			33,//双极灭星
			36,//黄龙钩镰刀
			48,//真霸道剑
			43,//龙骑尖
			42,//怒涛
			42,//日月乾坤圈
			31,//破军蛇矛
			43,//神龙升天刀
			41,//朱雀羽扇
			35,//业火
			45,//白炎黄狼剑
			32,//倚天奸剑
			33,//宵
			44,//霸王
			48,//凤嘴凰翼
			40,//破邪旋风斩
			39,//湖底苍月
			44,//月妖日狂
			38,//无奏
			46,//真黄龙剑
			28,//冥天照符
			47,//昂龙颚闪
			43,//煌天
			44,//白虎颚
			35,//真天狼剑
			46,//乔佳丽
			44,//无双方天戟
			33,//索冥牙角刃
			37,//幻龙炎闪剑
			40,//修罗破界棒
			47,//伏羲大剑
			44,//女娲细剑
			44,//刚咆神碎甲
			30,//火天玲珑刃
			40,//蟠龙红莲牙
			31,//堕落
		};
			
		
		//定义所有R5武器的体力上升值
		public static final int[] R5PhysicalStrengthValues={
			34,//黄龙偃月刀
			45,//白虎牙断
			51,//蚩尤瀑布碎
			40,//断海鞭
			37,//灭麒麟牙
			27,//霸海
			35,//金刚九天段
			42,//虎扑欧狼改
			42,//真极牛头
			39,//惊天动地
			28,//闪飞燕
			47,//金丽玉锤
			43,//豪龙胆
			44,//风伯破天棍
			32,//乔美丽
			22,//穷奇羽扇
			43,//豪风神杖
			35,//轰火神杖
			28,//朱雀虹
			38,//百兽王
			39,//古锭刀真打
			30,//阿修罗
			42,//轰天雷震盘
			42,//升天蛟龙鞭
			47,//双极灭星
			48,//黄龙钩镰刀
			40,//真霸道剑
			46,//龙骑尖
			32,//怒涛
			32,//日月乾坤圈
			41,//破军蛇矛
			30,//神龙升天刀
			43,//朱雀羽扇
			48,//业火
			33,//白炎黄狼剑
			43,//倚天奸剑
			49,//宵
			33,//霸王
			41,//凤嘴凰翼
			49,//破邪旋风斩
			35,//湖底苍月
			39,//月妖日狂
			32,//无奏
			34,//真黄龙剑
			31,//冥天照符
			34,//昂龙颚闪
			47,//煌天
			39,//白虎颚
			46,//真天狼剑
			36,//乔佳丽
			42,//无双方天戟
			40,//索冥牙角刃
			46,//幻龙炎闪剑
			36,//修罗破界棒
			32,//伏羲大剑
			33,//女娲细剑
			41,//刚咆神碎甲
			49,//火天玲珑刃
			34,//蟠龙红莲牙
			46,//堕落
		};
		
		//定义所有R5武器的无双上升值
		public static final int[] R5WushuangValues={
			44,//黄龙偃月刀
			48,//白虎牙断
			31,//蚩尤瀑布碎
			47,//断海鞭
			21,//灭麒麟牙
			48,//霸海
			44,//金刚九天段
			28,//虎扑欧狼改
			37,//真极牛头
			36,//惊天动地
			44,//闪飞燕
			33,//金丽玉锤
			31,//豪龙胆
			31,//风伯破天棍
			48,//乔美丽
			38,//穷奇羽扇
			34,//豪风神杖
			28,//轰火神杖
			28,//朱雀虹
			40,//百兽王
			30,//古锭刀真打
			44,//阿修罗
			35,//轰天雷震盘
			29,//升天蛟龙鞭
			47,//双极灭星
			29,//黄龙钩镰刀
			32,//真霸道剑
			34,//龙骑尖
			44,//怒涛
			46,//日月乾坤圈
			33,//破军蛇矛
			37,//神龙升天刀
			33,//朱雀羽扇
			30,//业火
			42,//白炎黄狼剑
			45,//倚天奸剑
			30,//宵
			41,//霸王
			35,//凤嘴凰翼
			29,//破邪旋风斩
			45,//湖底苍月
			46,//月妖日狂
			47,//无奏
			36,//真黄龙剑
			37,//冥天照符
			45,//昂龙颚闪
			38,//煌天
			44,//白虎颚
			28,//真天狼剑
			41,//乔佳丽
			31,//无双方天戟
			46,//索冥牙角刃
			36,//幻龙炎闪剑
			29,//修罗破界棒
			28,//伏羲大剑
			47,//女娲细剑
			36,//刚咆神碎甲
			34,//火天玲珑刃
			31,//蟠龙红莲牙
			42,//堕落
		};
		
		//定义所有R5武器的图片
//		public static final int[] R5Pic={
//			R.drawable.r5_1,//黄龙偃月刀
//			R.drawable.r5_2,//白虎牙断
//			R.drawable.r5_3,//蚩尤瀑布碎
//			R.drawable.r5_4,//断海鞭
//			R.drawable.r5_5,//灭麒麟牙
//			R.drawable.r5_6,//霸海
//			R.drawable.r5_7,//金刚九天段
//			R.drawable.r5_8,//虎扑欧狼改
//			R.drawable.r5_9,//真极牛头
//			R.drawable.r5_10,//惊天动地
//			R.drawable.r5_11,//闪飞燕
//			R.drawable.r5_12,//金丽玉锤
//			R.drawable.r5_13,//豪龙胆
//			R.drawable.r5_14,//风伯破天棍
//			R.drawable.r5_15,//乔美丽
//			R.drawable.r5_16,//穷奇羽扇
//			R.drawable.r5_17,//豪风神杖
//			R.drawable.r5_18,//轰火神杖
//			R.drawable.r5_19,//朱雀虹
//			R.drawable.r5_20,//百兽王			
//			R.drawable.r5_21,//古锭刀真打
//			R.drawable.r5_22,//阿修罗
//			R.drawable.r5_23,//轰天雷震盘
//			R.drawable.r5_24,//升天蛟龙鞭
//			R.drawable.r5_25,//双极灭星
//			R.drawable.r5_26,//黄龙钩镰刀
//			R.drawable.r5_27,//真霸道剑
//			R.drawable.r5_28,//龙骑尖
//			R.drawable.r5_29,//怒涛
//			R.drawable.r5_30,//日月乾坤圈
//			R.drawable.r5_31,//破军蛇矛
//			R.drawable.r5_32,//神龙升天刀
//			R.drawable.r5_33,//朱雀羽扇
//			R.drawable.r5_34,//业火
//			R.drawable.r5_35,//白炎黄狼剑
//			R.drawable.r5_36,//倚天奸剑
//			R.drawable.r5_37,//宵
//			R.drawable.r5_38,//霸王
//			R.drawable.r5_39,//凤嘴凰翼
//			R.drawable.r5_40,//破邪旋风斩
//			R.drawable.r5_41,//湖底苍月
//			R.drawable.r5_42,//月妖日狂
//			R.drawable.r5_43,//无奏
//			R.drawable.r5_44,//真黄龙剑
//			R.drawable.r5_45,//冥天照符
//			R.drawable.r5_46,//昂龙颚闪
//			R.drawable.r5_47,//煌天
//			R.drawable.r5_48,//白虎颚
//			R.drawable.r5_49,//真天狼剑
//			R.drawable.r5_50,//乔佳丽
//			R.drawable.r5_51,//无双方天戟
//			R.drawable.r5_52,//索冥牙角刃
//			R.drawable.r5_53,//幻龙炎闪剑
//			R.drawable.r5_54,//修罗破界棒
//			R.drawable.r5_55,//伏羲大剑
//			R.drawable.r5_56,//女娲细剑
//			R.drawable.r5_57,//刚咆神碎甲
//			R.drawable.r5_58,//火天玲珑刃
//			R.drawable.r5_59,//蟠龙红莲牙
//			R.drawable.r5_60,//堕落
//		};
	

}
