package com.wlx.wsolandroid.weapondata;

public class R7WeaponData {

	//定义所有R7武器名称
			public static final String[] R7Names={
				"真·黄龙偃月刀",
				"真·白虎牙断",
				"真·蚩尤瀑布碎",
				"真·断海鞭",
				"真·灭麒麟牙",	
				"真·霸海",
				"真·金刚九天段",
				"真·虎扑欧狼改",
				"真·真极牛头",
				"真·惊天动地",
				"真·闪飞燕",
				"真·金丽玉锤",
				"真·豪龙胆",
				"真·风伯破天棍",
				"真·乔美丽",
				"真·穷奇羽扇",
				"真·豪风神杖",
				"真·轰火神杖",
				"真·朱雀虹",
				"真·百兽王",		
				"真·古锭刀真打",
				"真·阿修罗",
				"真·轰天雷震盘",
				"真·升天蛟龙鞭",
				"真·双极灭星",
				"真·黄龙钩镰刀",
				"真·真霸道剑",
				"真·龙骑尖",
				"真·怒涛",
				"真·日月乾坤圈",
				"真·破军蛇矛",
				"真·神龙升天刀",
				"真·朱雀羽扇",
				"真·业火",
				"真·白炎黄狼剑",
				"真·倚天奸剑",
				"真·宵",
				"真·霸王",
				"真·凤嘴凰翼",
				"真·破邪旋风斩",
				"真·湖底苍月",
				"真·月妖日狂",
				"真·无奏",
				"真·真黄龙剑",
				"真·冥天照符",
				"真·昂龙颚闪",
				"真·煌天",
				"真·白虎颚",
				"真·真天狼剑",
				"真·乔佳丽",
				"真·无双方天戟",
				"真·索冥牙角刃",
				"真·幻龙炎闪剑",
				"真·修罗破界棒",
				"真·伏羲大剑",
				"真·女娲细剑",
				"真·刚咆神碎甲",
				"真·火天玲珑刃",
				"真·蟠龙红莲牙",
				"真·堕落"
			};
	
	
			
			
			
	
	
	
}
